# Kaggle Demand Forecasting with Fast.ai

See [competition details](https://www.kaggle.com/c/demand-forecasting-kernels-only)

This is largely based on the lesson3 notebook for the Rossman forecasting challenge.

In [36]:

%matplotlib  inline
%reload_ext autoreload
%autoreload 2

import pandas as pd
import numpy as np

from fastai.structured import *
from fastai.column_data import *
np.set_printoptions(threshold=50, edgeitems=20)

from IPython.display import HTML, display

# Load Data

In [37]:

train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')
ssub = pd.read_csv('sample_submission.csv')

print(f'train: {train.shape}', f'test {test.shape}')

train: (913000, 4) test (45000, 4)

In [38]:
train.head()

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [39]:
test.head()

   id        date  store  item
0   0  2018-01-01      1     1
1   1  2018-01-02      1     1
2   2  2018-01-03      1     1
3   3  2018-01-04      1     1
4   4  2018-01-05      1     1

In [40]:
for col in ['store', 'item']:
    train[col] = train[col].astype('category')
    test[col] = test[col].astype('category')
    
train.describe(include='all')

              date     store      item          sales
count       913000  913000.0  913000.0  913000.000000
unique        1826      10.0      50.0            NaN
top     2013-03-13      10.0      50.0            NaN
freq           500   91300.0   18260.0            NaN
mean           NaN       NaN       NaN      52.250287
std            NaN       NaN       NaN      28.801144
min            NaN       NaN       NaN       0.000000
25%            NaN       NaN       NaN      30.000000
50%            NaN       NaN       NaN      47.000000
75%            NaN       NaN       NaN      70.000000
max            NaN       NaN       NaN     231.000000

In [41]:
train.isnull().sum()

date     0
store    0
item     0
sales    0
dtype: int64

# Feature Engineering

In [43]:
train2 = train.copy()
test2 = test.copy()

add_datepart(train2, "date")
add_datepart(test2, "date")
train2.head()

,store,item,sales,Year,Month,Week,Day,Dayofweek,Dayofyear,Is_month_end,Is_month_start,Is_quarter_end,Is_quarter_start,Is_year_end,Is_year_start,Elapsed
0,1,1,13,2013,1,1,1,1,1,False,True,False,True,False,True,1356998400
1,1,1,11,2013,1,1,2,2,2,False,False,False,False,False,False,1357084800
2,1,1,14,2013,1,1,3,3,3,False,False,False,False,False,False,1357171200
3,1,1,13,2013,1,1,4,4,4,False,False,False,False,False,False,1357257600
4,1,1,10,2013,1,1,5,5,5,False,False,False,False,False,False,1357344000